tap "koekeishiya/formulae"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern, maintained replacement for ls
brew "eza"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Improved Nano Syntax Highlighting Files
brew "nanorc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python version management
brew "pyenv"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Next-generation plugin manager for zsh
brew "zplug"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
cask "font-fira-code"
cask "font-hack-nerd-font"
# Web browser
cask "google-chrome"
# Terminal built on web technologies
cask "hyper"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Finder Toolbar app to open the current directory in Terminal or Editor
cask "openinterminal"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Messaging app with a focus on speed and security
cask "telegram"
vscode "anysphere.cursorpyright"
vscode "davidanson.vscode-markdownlint"
vscode "editorconfig.editorconfig"
vscode "fogio.jetbrains-color-theme"
vscode "fogio.jetbrains-file-icon-theme"
vscode "github.vscode-github-actions"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-vscode.makefile-tools"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
